src/Catalogs/ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя/Ext/ManagerModule.bsl
Функция ВзаимосвязьУникальна(СвзяьОбъект) Экспорт
	
	ВзаимосвязьУникальна = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка
	|ИЗ
	|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
	|ГДЕ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус = &ТекущийСтатус
	|	И ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус = &СледующийСтатус
	|	И НЕ ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СвзяьОбъект.Ссылка);
	Запрос.УстановитьПараметр("СледующийСтатус", СвзяьОбъект.СледующийСтатус);
	Запрос.УстановитьПараметр("ТекущийСтатус", СвзяьОбъект.ТекущийСтатус);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ВзаимосвязьУникальна = Ложь;
	КонецЕсли;

	Возврат ВзаимосвязьУникальна;
	
КонецФункции
